07_archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/03_main_reef1/system/fvSolution
FoamFile
{
    version 2.0; format ascii; class dictionary; object fvSolution;
}
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.05; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
    k { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
    omega { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    residualControl
    {
        p 1e-4;
        U 1e-5;
        k 1e-5;
        omega 1e-5;
    }
}
relaxationFactors
{
    fields { p 0.3; }
    equations { U 0.5; k 0.5; omega 0.5; }
}
